[
  {
    "term": "Market Cap",
    "description": "The total market value of a company's outstanding shares. It is calculated by multiplying the company's shares outstanding by the current market price of one share."
  },
  {
    "term": "PE Ratio",
    "description": "A valuation measure that compares the current share price of a company to its per-share earnings. A high PE ratio could mean that a company's stock is over-valued, or investors are expecting high growth rates in the future."
  },
  {
    "term": "Dividend Yield",
    "description": "A financial ratio that shows how much a company pays out in dividends each year relative to its stock price. It is often used by investors seeking income from their investments."
  },
  {
    "term": "Beta",
    "description": "A measure of a stock's volatility in relation to the overall market. A beta greater than 1 indicates that the stock is more volatile than the market, while a beta less than 1 means it is less volatile."
  },
  {
    "term": "Earnings Per Share (EPS)",
    "description": "The portion of a company's profit allocated to each outstanding share of common stock. EPS serves as an indicator of a company's profitability."
  },
  {
    "term": "Operating Margin",
    "description": "A measure of profitability that shows what percentage of a company's revenue is left over after paying for variable costs of production such as wages and raw materials."
  },
  {
    "term": "Return on Assets (ROA)",
    "description": "An indicator of how profitable a company is relative to its total assets, showing how efficient management is at using its assets to generate earnings."
  },
  {
    "term": "Free Cash Flow",
    "description": "A measure of financial performance that shows how much cash is generated by the company after accounting for capital expenditures to maintain or expand its asset base."
  },
  {
    "term": "Price-to-Book Ratio (P/B Ratio)",
    "description": "A ratio used to compare a firm's market capitalization to its book value, providing insights into the value that the market places on the company's equity."
  },
  {
    "term": "Debt-to-Earnings Ratio",
    "description": "A financial ratio indicating the relative proportion of shareholders' equity and debt used to finance a company's assets, closely related to leveraging."
  },
  {
    "term": "Current Yield",
    "description": "The annual income (interest or dividends) divided by the current price of the security. This measure is used to calculate the yield on a bond at its current market price."
  },
  {
    "term": "Earnings Yield",
    "description": "The inverse of the PE ratio, this yield shows the percentage of each dollar invested in the stock that was earned by the company. It's a way to compare the profitability of a company against other investments."
  }
]
